# За лятната ваканция в списъка със задължителна литература на Жоро има определен брой книги. 
# Понеже Жоро предпочита да играе с приятели навън, 
# вашата задача е да му помогнете да изчисли колко часа на ден трябва да отделя,
# за да прочете необходимата литература.
# Вход
# От конзолата се четат 3 реда:
# 1.	Брой страници в текущата книга – цяло число в интервала [1…1000]
# 2.	Страници, които прочита за 1 час – цяло число в интервала [1…1000]
# 3.	Броят на дните, за които трябва да прочете книгата – цяло число в интервала [1…1000]




from math import floor

num_of_pages_in_book = int(input())
total_pages = int(input())
num_of_days = int(input())

total_time_of_reading = num_of_pages_in_book / total_pages
hours_per_day = total_time_of_reading / num_of_days
print(floor(hours_per_day))